This PR will be making the following changes to the resources:
<details>
<summary>Terraform plan</summary>

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # docker_image.app has been deleted
  - resource "docker_image" "app" {
        id       = "sha256:03bbaa72ed2b5e5cb7b1d71102c17c2dc779bd7a6496f62c6ca089ff42e3ffbfeu.gcr.io/online-classifier-app/app"
      - image_id = "sha256:03bbaa72ed2b5e5cb7b1d71102c17c2dc779bd7a6496f62c6ca089ff42e3ffbf" -> null
      - name     = "eu.gcr.io/online-classifier-app/app" -> null
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # docker_image.app will be created
  + resource "docker_image" "app" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/online-classifier-app/app"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "c05f9163549ba6133e18106e61a939f943d66768"
        }

      + build {
          + build_args   = {
              + "HOST_URL" = "https://service-deployment-kttol2mhha-nw.a.run.app/"
            }
          + cache_from   = []
          + context      = "/workspace/terraform/.."
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = []
        }
    }

  # docker_registry_image.app must be replaced
-/+ resource "docker_registry_image" "app" {
      ~ id                   = "sha256:c5b45ac37b46d856aa32cb6876af95c47dd0728cdd9dbc73c4b4ca55b82fff51" -> (known after apply)
        name                 = "eu.gcr.io/online-classifier-app/app"
      ~ sha256_digest        = "sha256:c5b45ac37b46d856aa32cb6876af95c47dd0728cdd9dbc73c4b4ca55b82fff51" -> (known after apply)
      ~ triggers             = { # forces replacement
          - "image_digest" = "sha256:03bbaa72ed2b5e5cb7b1d71102c17c2dc779bd7a6496f62c6ca089ff42e3ffbf"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_cloud_run_v2_service.default will be updated in-place
  ~ resource "google_cloud_run_v2_service" "default" {
        id                      = "projects/online-classifier-app/locations/europe-west2/services/service-deployment"
        name                    = "service-deployment"
        # (17 unchanged attributes hidden)

      ~ template {
            # (5 unchanged attributes hidden)

          ~ containers {
              ~ image   = "eu.gcr.io/online-classifier-app/app@sha256:c5b45ac37b46d856aa32cb6876af95c47dd0728cdd9dbc73c4b4ca55b82fff51" -> (known after apply)
                # (2 unchanged attributes hidden)

                # (3 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>
